MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
/* IPC6 */
#define _DMA2IP IPC6bits.DMA2IP
#define _OC3IP IPC6bits.OC3IP
#define _DMA2IP0 IPC6bits.DMA2IP0
#define _DMA2IP1 IPC6bits.DMA2IP1
#define _DMA2IP2 IPC6bits.DMA2IP2
#define _OC3IP0 IPC6bits.OC3IP0
#define _OC3IP1 IPC6bits.OC3IP1
#define _OC3IP2 IPC6bits.OC3IP2
#define _T4IP0 IPC6bits.T4IP0
#define _T4IP1 IPC6bits.T4IP1
#define _T4IP2 IPC6bits.T4IP2

/* IPC7 */
#define _INT2IP IPC7bits.INT2IP
#define _U2RXIP IPC7bits.U2RXIP
#define _U2TXIP IPC7bits.U2TXIP
#define _T5IP0 IPC7bits.T5IP0
#define _T5IP1 IPC7bits.T5IP1
#define _T5IP2 IPC7bits.T5IP2
#define _INT2IP0 IPC7bits.INT2IP0
#define _INT2IP1 IPC7bits.INT2IP1
#define _INT2IP2 IPC7bits.INT2IP2
#define _U2RXIP0 IPC7bits.U2RXIP0
#define _U2RXIP1 IPC7bits.U2RXIP1
#define _U2RXIP2 IPC7bits.U2RXIP2
#define _U2TXIP0 IPC7bits.U2TXIP0
#define _U2TXIP1 IPC7bits.U2TXIP1
#define _U2TXIP2 IPC7bits.U2TXIP2

/* IPC8 */
#define _SPI2IP IPC8bits.SPI2IP
#define _SPI2TXIP IPC8bits.SPI2TXIP
#define _SPI2IP0 IPC8bits.SPI2IP0
#define _SPI2IP1 IPC8bits.SPI2IP1
#define _SPI2IP2 IPC8bits.SPI2IP2
#define _SPI2TXIP0 IPC8bits.SPI2TXIP0
#define _SPI2TXIP1 IPC8bits.SPI2TXIP1
#define _SPI2TXIP2 IPC8bits.SPI2TXIP2

/* IPC9 */
#define _DMA3IP IPC9bits.DMA3IP
#define _IC3IP IPC9bits.IC3IP
#define _DMA3IP0 IPC9bits.DMA3IP0
#define _DMA3IP1 IPC9bits.DMA3IP1
#define _DMA3IP2 IPC9bits.DMA3IP2
#define _IC3IP0 IPC9bits.IC3IP0
#define _IC3IP1 IPC9bits.IC3IP1
#define _IC3IP2 IPC9bits.IC3IP2

/* IPC10 */
#define _CCT3IP IPC10bits.CCT3IP
#define _CCT3IP0 IPC10bits.CCT3IP0
#define _CCT3IP1 IPC10bits.CCT3IP1
#define _CCT3IP2 IPC10bits.CCT3IP2

/* IPC11 */
#define _CCT4IP IPC11bits.CCT4IP
#define _PMPIP IPC11bits.PMPIP
#define _DMA4IP IPC11bits.DMA4IP
#define _CCT4IP0 IPC11bits.CCT4IP0
#define _CCT4IP1 IPC11bits.CCT4IP1
#define _CCT4IP2 IPC11bits.CCT4IP2
#define _PMPIP0 IPC11bits.PMPIP0
#define _PMPIP1 IPC11bits.PMPIP1
#define _PMPIP2 IPC11bits.PMPIP2
#define _DMA4IP0 IPC11bits.DMA4IP0
#define _DMA4IP1 IPC11bits.DMA4IP1
#define _DMA4IP2 IPC11bits.DMA4IP2
#define _CCT5IP0 IPC11bits.CCT5IP0
#define _CCT5IP1 IPC11bits.CCT5IP1
#define _CCT5IP2 IPC11bits.CCT5IP2

/* IPC12 */
#define _SI2C2IP IPC12bits.SI2C2IP
#define _MI2C2IP IPC12bits.MI2C2IP
#define _CCT6IP0 IPC12bits.CCT6IP0
#define _CCT6IP1 IPC12bits.CCT6IP1
#define _CCT6IP2 IPC12bits.CCT6IP2
#define _SI2C2IP0 IPC12bits.SI2C2IP0
#define _SI2C2IP1 IPC12bits.SI2C2IP1
#define _SI2C2IP2 IPC12bits.SI2C2IP2
#define _MI2C2IP0 IPC12bits.MI2C2IP0
#define _MI2C2IP1 IPC12bits.MI2C2IP1
#define _MI2C2IP2 IPC12bits.MI2C2IP2
#define _CCT7IP0 IPC12bits.CCT7IP0
#define _CCT7IP1 IPC12bits.CCT7IP1
#define _CCT7IP2 IPC12bits.CCT7IP2
#define _SI2C2P0 IPC12bits.SI2C2P0
#define _SI2C2P1 IPC12bits.SI2C2P1
#define _SI2C2P2 IPC12bits.SI2C2P2
#define _MI2C2P0 IPC12bits.MI2C2P0
#define _MI2C2P1 IPC12bits.MI2C2P1
#define _MI2C2P2 IPC12bits.MI2C2P2
#define _SI2C2P IPC12bits.SI2C2P
#define _MI2C2P IPC12bits.MI2C2P

/* IPC13 */
#define _INT3IP IPC13bits.INT3IP
#define _INT4IP IPC13bits.INT4IP
#define _INT3IP0 IPC13bits.INT3IP0
#define _INT3IP1 IPC13bits.INT3IP1
#define _INT3IP2 IPC13bits.INT3IP2
#define _INT4IP0 IPC13bits.INT4IP0
#define _INT4IP1 IPC13bits.INT4IP1
#define _INT4IP2 IPC13bits.INT4IP2

/* IPC14 */
#define _SPI1RXIP IPC14bits.SPI1RXIP
#define _SPI2RXIP IPC14bits.SPI2RXIP
#define _SPI1RXIP0 IPC14bits.SPI1RXIP0
#define _SPI1RXIP1 IPC14bits.SPI1RXIP1
#define _SPI1RXIP2 IPC14bits.SPI1RXIP2
#define _SPI2RXIP0 IPC14bits.SPI2RXIP0
#define _SPI2RXIP1 IPC14bits.SPI2RXIP1
#define _SPI2RXIP2 IPC14bits.SPI2RXIP2

/* IPC15 */
#define _SPI3RXIP IPC15bits.SPI3RXIP
#define _DMA5IP IPC15bits.DMA5IP
#define _RTCIP IPC15bits.RTCIP
#define _CCP1IP IPC15bits.CCP1IP
#define _SPI3RXIP0 IPC15bits.SPI3RXIP0
#define _SPI3RXIP1 IPC15bits.SPI3RXIP1
#define _SPI3RXIP2 IPC15bits.SPI3RXIP2
#define _DMA5IP0 IPC15bits.DMA5IP0
#define _DMA5IP1 IPC15bits.DMA5IP1
#define _DMA5IP2 IPC15bits.DMA5IP2
#define _RTCIP0 IPC15bits.RTCIP0
#define _RTCIP1 IPC15bits.RTCIP1
#define _RTCIP2 IPC15bits.RTCIP2
#define _CCP1IP0 IPC15bits.CCP1IP0
#define _CCP1IP1 IPC15bits.CCP1IP1
#define _CCP1IP2 IPC15bits.CCP1IP2

/* IPC16 */
#define _CCP2IP IPC16bits.CCP2IP
#define _U1ERIP IPC16bits.U1ERIP
#define _U2ERIP IPC16bits.U2ERIP
#define _CRCIP IPC16bits.CRCIP
#define _CCP2IP0 IPC16bits.CCP2IP0
#define _CCP2IP1 IPC16bits.CCP2IP1
#define _CCP2IP2 IPC16bits.CCP2IP2
#define _U1ERIP0 IPC16bits.U1ERIP0
#define _U1ERIP1 IPC16bits.U1ERIP1
#define _U1ERIP2 IPC16bits.U1ERIP2
#define _U2ERIP0 IPC16bits.U2ERIP0
#define _U2ERIP1 IPC16bits.U2ERIP1
#define _U2ERIP2 IPC16bits.U2ERIP2
#define _CRCIP0 IPC16bits.CRCIP0
#define _CRCIP1 IPC16bits.CRCIP1
#define _CRCIP2 IPC16bits.CRCIP2

/* IPC17 */
#define _DMA6IP0 IPC17bits.DMA6IP0
#define _DMA6IP1 IPC17bits.DMA6IP1
#define _DMA6IP2 IPC17bits.DMA6IP2
#define _DMA7IP0 IPC17bits.DMA7IP0
#define _DMA7IP1 IPC17bits.DMA7IP1
#define _DMA7IP2 IPC17bits.DMA7IP2
#define _SI2C3IP0 IPC17bits.SI2C3IP0
#define _SI2C3IP1 IPC17bits.SI2C3IP1
#define _SI2C3IP2 IPC17bits.SI2C3IP2
#define _MI2C3IP0 IPC17bits.MI2C3IP0
#define _MI2C3IP1 IPC17bits.MI2C3IP1
#define _MI2C3IP2 IPC17bits.MI2C3IP2

/* IPC18 */
#define _LVDIP IPC18bits.LVDIP
#define _LVDIP0 IPC18bits.LVDIP0
#define _LVDIP1 IPC18bits.LVDIP1
#define _LVDIP2 IPC18bits.LVDIP2
#define _CCP7IP0 IPC18bits.CCP7IP0
#define _CCP7IP1 IPC18bits.CCP7IP1
#define _CCP7IP2 IPC18bits.CCP7IP2

/* IPC19 */
#define _CTMUIP IPC19bits.CTMUIP
#define _CTMUIP0 IPC19bits.CTMUIP0
#define _CTMUIP1 IPC19bits.CTMUIP1
#define _CTMUIP2 IPC19bits.CTMUIP2

/* IPC20 */
#define _U3ERIP0 IPC20bits.U3ERIP0
#define _U3ERIP1 IPC20bits.U3ERIP1
#define _U3ERIP2 IPC20bits.U3ERIP2
#define _U3RXIP0 IPC20bits.U3RXIP0
#define _U3RXIP1 IPC20bits.U3RXIP1
#define _U3RXIP2 IPC20bits.U3RXIP2
#define _U3TXIP0 IPC20bits.U3TXIP0
#define _U3TXIP1 IPC20bits.U3TXIP1
#define _U3TXIP2 IPC20bits.U3TXIP2

/* IPC21 */
#define _I2C1BCIP IPC21bits.I2C1BCIP
#define _I2C2BCIP IPC21bits.I2C2BCIP
#define _USB1IP0 IPC21bits.USB1IP0
#define _USB1IP1 IPC21bits.USB1IP1
#define _USB1IP2 IPC21bits.USB1IP2
#define _U4ERIP0 IPC21bits.U4ERIP0
#define _U4ERIP1 IPC21bits.U4ERIP1
#define _U4ERIP2 IPC21bits.U4ERIP2

/* IPC22 */
#define _SPI3IP IPC22bits.SPI3IP
#define _SPI3TXIP IPC22bits.SPI3TXIP
#define _U4RXIP0 IPC22bits.U4RXIP0
#define _U4RXIP1 IPC22bits.U4RXIP1
#define _U4RXIP2 IPC22bits.U4RXIP2
#define _U4TXIP0 IPC22bits.U4TXIP0
#define _U4TXIP1 IPC22bits.U4TXIP1
#define _U4TXIP2 IPC22bits.U4TXIP2
#define _SPI3IP0 IPC22bits.SPI3IP0
#define _SPI3IP1 IPC22bits.SPI3IP1
#define _SPI3IP2 IPC22bits.SPI3IP2
#define _SPI3TXIP0 IPC22bits.SPI3TXIP0
#define _SPI3TXIP1 IPC22bits.SPI3TXIP1
#define _SPI3TXIP2 IPC22bits.SPI3TXIP2

