MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
/* IPC23 */
#define _CCP3IP IPC23bits.CCP3IP
#define _CCP4IP IPC23bits.CCP4IP
#define _CCP3IP0 IPC23bits.CCP3IP0
#define _CCP3IP1 IPC23bits.CCP3IP1
#define _CCP3IP2 IPC23bits.CCP3IP2
#define _CCP4IP0 IPC23bits.CCP4IP0
#define _CCP4IP1 IPC23bits.CCP4IP1
#define _CCP4IP2 IPC23bits.CCP4IP2

/* IPC24 */
#define _CLC1IP IPC24bits.CLC1IP
#define _CLC2IP IPC24bits.CLC2IP
#define _CLC1IP0 IPC24bits.CLC1IP0
#define _CLC1IP1 IPC24bits.CLC1IP1
#define _CLC1IP2 IPC24bits.CLC1IP2
#define _CLC2IP0 IPC24bits.CLC2IP0
#define _CLC2IP1 IPC24bits.CLC2IP1
#define _CLC2IP2 IPC24bits.CLC2IP2
#define _CLC3IP0 IPC24bits.CLC3IP0
#define _CLC3IP1 IPC24bits.CLC3IP1
#define _CLC3IP2 IPC24bits.CLC3IP2
#define _CLC4IP0 IPC24bits.CLC4IP0
#define _CLC4IP1 IPC24bits.CLC4IP1
#define _CLC4IP2 IPC24bits.CLC4IP2

/* IPC25 */
#define _CCT1IP IPC25bits.CCT1IP
#define _CCT2IP IPC25bits.CCT2IP
#define _CCT1IP0 IPC25bits.CCT1IP0
#define _CCT1IP1 IPC25bits.CCT1IP1
#define _CCT1IP2 IPC25bits.CCT1IP2
#define _CCT2IP0 IPC25bits.CCT2IP0
#define _CCT2IP1 IPC25bits.CCT2IP1
#define _CCT2IP2 IPC25bits.CCT2IP2

/* IPC26 */
#define _FSTIP IPC26bits.FSTIP
#define _FSTIP0 IPC26bits.FSTIP0
#define _FSTIP1 IPC26bits.FSTIP1
#define _FSTIP2 IPC26bits.FSTIP2

/* IPC27 */
#define _ECCIP IPC27bits.ECCIP
#define _RTCCTSIP IPC27bits.RTCCTSIP
#define _I2C3BCIP0 IPC27bits.I2C3BCIP0
#define _I2C3BCIP1 IPC27bits.I2C3BCIP1
#define _I2C3BCIP2 IPC27bits.I2C3BCIP2
#define _RTCCTCIP0 IPC27bits.RTCCTCIP0
#define _RTCCTSIP1 IPC27bits.RTCCTSIP1
#define _RTCCTSIP2 IPC27bits.RTCCTSIP2
#define _U5RXIP0 IPC27bits.U5RXIP0
#define _U5RXIP1 IPC27bits.U5RXIP1
#define _U5RXIP2 IPC27bits.U5RXIP2

/* IPC28 */
#define _U5TXIP0 IPC28bits.U5TXIP0
#define _U5TXIP1 IPC28bits.U5TXIP1
#define _U5TXIP2 IPC28bits.U5TXIP2
#define _U5ERIP0 IPC28bits.U5ERIP0
#define _U5ERIP1 IPC28bits.U5ERIP1
#define _U5ERIP2 IPC28bits.U5ERIP2
#define _U6RXIP0 IPC28bits.U6RXIP0
#define _U6RXIP1 IPC28bits.U6RXIP1
#define _U6RXIP2 IPC28bits.U6RXIP2
#define _U6TXIP0 IPC28bits.U6TXIP0
#define _U6TXIP1 IPC28bits.U6TXIP1
#define _U6TXIP2 IPC28bits.U6TXIP2

/* IPC29 */
#define _JTAGIP IPC29bits.JTAGIP
#define _U6ERIP0 IPC29bits.U6ERIP0
#define _U6ERIP1 IPC29bits.U6ERIP1
#define _U6ERIP2 IPC29bits.U6ERIP2
#define _JTAGIP0 IPC29bits.JTAGIP0
#define _JTAGIP1 IPC29bits.JTAGIP1
#define _JTAGIP2 IPC29bits.JTAGIP2

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VHOLD INTTREGbits.VHOLD
#define _CPUIRQ INTTREGbits.CPUIRQ
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _VECNUM7 INTTREGbits.VECNUM7
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _SOSCEN OSCCONbits.SOSCEN
#define _POSCEN OSCCONbits.POSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLEN CLKDIVbits.PLLEN
#define _CPDIV CLKDIVbits.CPDIV
#define _RCDIV CLKDIVbits.RCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _CPDIV0 CLKDIVbits.CPDIV0
#define _CPDIV1 CLKDIVbits.CPDIV1
#define _RCDIV0 CLKDIVbits.RCDIV0
#define _RCDIV1 CLKDIVbits.RCDIV1
#define _RCDIV2 CLKDIVbits.RCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _STORPOL OSCTUNbits.STORPOL
#define _STOR OSCTUNbits.STOR
#define _STLPOL OSCTUNbits.STLPOL
#define _STLOCK OSCTUNbits.STLOCK
#define _STSRC OSCTUNbits.STSRC
#define _STSIDL OSCTUNbits.STSIDL
#define _STEN OSCTUNbits.STEN
/* Bitname _TUN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN5 cannot be defined because it is used by more than one SFR */

/* DCOTUN */
#define _DCOTUN DCOTUNbits.DCOTUN
/* Bitname _TUN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN5 cannot be defined because it is used by more than one SFR */

/* DCOCON */
#define _DCOFSEL DCOCONbits.DCOFSEL
#define _DCOEN DCOCONbits.DCOEN
#define _DCOFSEL0 DCOCONbits.DCOFSEL0
#define _DCOFSEL1 DCOCONbits.DCOFSEL1
#define _DCOFSEL2 DCOCONbits.DCOFSEL2
#define _DCOFSEL3 DCOCONbits.DCOFSEL3

/* OSCDIV */
#define _DIV OSCDIVbits.DIV
#define _DIV0 OSCDIVbits.DIV0
#define _DIV1 OSCDIVbits.DIV1
#define _DIV2 OSCDIVbits.DIV2
#define _DIV3 OSCDIVbits.DIV3
#define _DIV4 OSCDIVbits.DIV4
#define _DIV5 OSCDIVbits.DIV5
#define _DIV6 OSCDIVbits.DIV6
#define _DIV7 OSCDIVbits.DIV7
#define _DIV8 OSCDIVbits.DIV8
#define _DIV9 OSCDIVbits.DIV9
#define _DIV10 OSCDIVbits.DIV10
#define _DIV11 OSCDIVbits.DIV11
#define _DIV12 OSCDIVbits.DIV12
#define _DIV13 OSCDIVbits.DIV13
#define _DIV14 OSCDIVbits.DIV14

/* OSCFDIV */
#define _TRIM OSCFDIVbits.TRIM
#define _TRIM8 OSCFDIVbits.TRIM8
#define _TRIM7 OSCFDIVbits.TRIM7
#define _TRIM6 OSCFDIVbits.TRIM6
#define _TRIM5 OSCFDIVbits.TRIM5
#define _TRIM4 OSCFDIVbits.TRIM4
#define _TRIM3 OSCFDIVbits.TRIM3
#define _TRIM2 OSCFDIVbits.TRIM2
#define _TRIM1 OSCFDIVbits.TRIM1
#define _TRIM0 OSCFDIVbits.TRIM0

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
/* Bitname _CM cannot be defined because it is used by more than one SFR */
#define _RETEN RCONbits.RETEN
#define _SBOREN RCONbits.SBOREN
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR
#define _PMSLP RCONbits.PMSLP

/* HLVDCON */
#define _HLVDL HLVDCONbits.HLVDL
#define _LVDEVT HLVDCONbits.LVDEVT
#define _IRVST HLVDCONbits.IRVST
#define _BGVST HLVDCONbits.BGVST
#define _VDIR HLVDCONbits.VDIR
#define _LSIDL HLVDCONbits.LSIDL
#define _HLVDEN HLVDCONbits.HLVDEN
#define _HLVDL0 HLVDCONbits.HLVDL0
#define _HLVDL1 HLVDCONbits.HLVDL1
#define _HLVDL2 HLVDCONbits.HLVDL2
#define _HLVDL3 HLVDCONbits.HLVDL3

/* CRCCON1 */
#define _LENDIAN CRCCON1bits.LENDIAN
#define _CRCGO CRCCON1bits.CRCGO
#define _CRCISEL CRCCON1bits.CRCISEL
#define _CRCMPT CRCCON1bits.CRCMPT
#define _CRCFUL CRCCON1bits.CRCFUL
#define _VWORD CRCCON1bits.VWORD
#define _CSIDL CRCCON1bits.CSIDL
#define _CRCEN CRCCON1bits.CRCEN
#define _VWORD0 CRCCON1bits.VWORD0
#define _VWORD1 CRCCON1bits.VWORD1
#define _VWORD2 CRCCON1bits.VWORD2
#define _VWORD3 CRCCON1bits.VWORD3
#define _VWORD4 CRCCON1bits.VWORD4

/* CRCCON2 */
#define _PLEN CRCCON2bits.PLEN
#define _DWIDTH CRCCON2bits.DWIDTH
#define _PLEN0 CRCCON2bits.PLEN0
#define _PLEN1 CRCCON2bits.PLEN1
#define _PLEN2 CRCCON2bits.PLEN2
#define _PLEN3 CRCCON2bits.PLEN3
#define _PLEN4 CRCCON2bits.PLEN4
#define _DWIDTH0 CRCCON2bits.DWIDTH0
#define _DWIDTH1 CRCCON2bits.DWIDTH1
#define _DWIDTH2 CRCCON2bits.DWIDTH2
#define _DWIDTH3 CRCCON2bits.DWIDTH3
#define _DWIDTH4 CRCCON2bits.DWIDTH4

/* CRCXORL */
#define _X1 CRCXORLbits.X1
#define _X2 CRCXORLbits.X2
#define _X3 CRCXORLbits.X3
#define _X4 CRCXORLbits.X4
#define _X5 CRCXORLbits.X5
#define _X6 CRCXORLbits.X6
#define _X7 CRCXORLbits.X7
#define _X8 CRCXORLbits.X8
#define _X9 CRCXORLbits.X9
#define _X10 CRCXORLbits.X10
#define _X11 CRCXORLbits.X11
#define _X12 CRCXORLbits.X12
#define _X13 CRCXORLbits.X13
#define _X14 CRCXORLbits.X14
#define _X15 CRCXORLbits.X15

