MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
/* IC3CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _ICTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _IC32 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */

/* OC1CON1 */
/* Bitname _OCM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGMODE cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT2 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT0 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _OCM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTB cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTC cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTB cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTC cannot be defined because it is used by more than one SFR */

/* OC1CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIS cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _OC32 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _OCINV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTTRIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTOUT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMD cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMODE cannot be defined because it is used by more than one SFR */

/* OC2CON1 */
/* Bitname _OCM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGMODE cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT2 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT0 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _OCM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTB cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTC cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTB cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTC cannot be defined because it is used by more than one SFR */

/* OC2CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIS cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _OC32 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _OCINV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTTRIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTOUT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMD cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMODE cannot be defined because it is used by more than one SFR */

/* OC3CON1 */
/* Bitname _OCM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGMODE cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT2 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT0 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _OCM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCM2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLT cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _OCTSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTB cannot be defined because it is used by more than one SFR */
/* Bitname _OCFLTC cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTA cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTB cannot be defined because it is used by more than one SFR */
/* Bitname _ENFLTC cannot be defined because it is used by more than one SFR */

/* OC3CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIS cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _OCTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _OC32 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _OCINV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTTRIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTOUT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMD cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTMODE cannot be defined because it is used by more than one SFR */

/* CCP1CON1L */
/* Bitname _MOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _TMRSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSLP cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _CCPON cannot be defined because it is used by more than one SFR */
/* Bitname _MOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMR32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD3 cannot be defined because it is used by more than one SFR */

/* CCP1CON1H */
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ALTSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ONESHOT cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPS cannot be defined because it is used by more than one SFR */
/* Bitname _RTRGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPSSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC4 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _OPSRC cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS3 cannot be defined because it is used by more than one SFR */

/* CCP1CON2L */
/* Bitname _ASDG cannot be defined because it is used by more than one SFR */
/* Bitname _SSDG cannot be defined because it is used by more than one SFR */
/* Bitname _ASDGM cannot be defined because it is used by more than one SFR */
/* Bitname _PWMRSEN cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG0 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG1 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG2 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG3 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG4 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG5 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG6 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG7 cannot be defined because it is used by more than one SFR */

/* CCP1CON2H */
/* Bitname _ICS cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM cannot be defined because it is used by more than one SFR */
/* Bitname _OCAEN cannot be defined because it is used by more than one SFR */
/* Bitname _OCBEN cannot be defined because it is used by more than one SFR */
#define _OCCEN CCP1CON2Hbits.OCCEN
#define _OCDEN CCP1CON2Hbits.OCDEN
#define _OCEEN CCP1CON2Hbits.OCEEN
#define _OCFEN CCP1CON2Hbits.OCFEN
/* Bitname _OENSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ICS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL2 cannot be defined because it is used by more than one SFR */

/* CCP1CON3L */
#define _DT CCP1CON3Lbits.DT
#define _DT0 CCP1CON3Lbits.DT0
#define _DT1 CCP1CON3Lbits.DT1
#define _DT2 CCP1CON3Lbits.DT2
#define _DT3 CCP1CON3Lbits.DT3
#define _DT4 CCP1CON3Lbits.DT4
#define _DT5 CCP1CON3Lbits.DT5

/* CCP1CON3H */
/* Bitname _PSSBDF cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE cannot be defined because it is used by more than one SFR */
/* Bitname _POLBDF cannot be defined because it is used by more than one SFR */
/* Bitname _POLACE cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT cannot be defined because it is used by more than one SFR */
/* Bitname _OETRIG cannot be defined because it is used by more than one SFR */
/* Bitname _PSSBDF0 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSBDF1 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE1 cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM0 cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM1 cannot be defined because it is used by more than one SFR */
/* Bitname _OUTM2 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT2 cannot be defined because it is used by more than one SFR */

