MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
#define _IFS2_CCT3IF_POSITION                    0x0000000B
#define _IFS2_CCT3IF_MASK                        0x00000800
#define _IFS2_CCT3IF_LENGTH                      0x00000001

#define _IFS2_CCT4IF_POSITION                    0x0000000C
#define _IFS2_CCT4IF_MASK                        0x00001000
#define _IFS2_CCT4IF_LENGTH                      0x00000001

#define _IFS2_PMPIF_POSITION                     0x0000000D
#define _IFS2_PMPIF_MASK                         0x00002000
#define _IFS2_PMPIF_LENGTH                       0x00000001

#define _IFS2_DMA4IF_POSITION                    0x0000000E
#define _IFS2_DMA4IF_MASK                        0x00004000
#define _IFS2_DMA4IF_LENGTH                      0x00000001

#define _IFS3_SI2C2IF_POSITION                   0x00000001
#define _IFS3_SI2C2IF_MASK                       0x00000002
#define _IFS3_SI2C2IF_LENGTH                     0x00000001

#define _IFS3_MI2C2IF_POSITION                   0x00000002
#define _IFS3_MI2C2IF_MASK                       0x00000004
#define _IFS3_MI2C2IF_LENGTH                     0x00000001

#define _IFS3_INT3IF_POSITION                    0x00000005
#define _IFS3_INT3IF_MASK                        0x00000020
#define _IFS3_INT3IF_LENGTH                      0x00000001

#define _IFS3_INT4IF_POSITION                    0x00000006
#define _IFS3_INT4IF_MASK                        0x00000040
#define _IFS3_INT4IF_LENGTH                      0x00000001

#define _IFS3_SPI1RXIF_POSITION                  0x0000000A
#define _IFS3_SPI1RXIF_MASK                      0x00000400
#define _IFS3_SPI1RXIF_LENGTH                    0x00000001

#define _IFS3_SPI2RXIF_POSITION                  0x0000000B
#define _IFS3_SPI2RXIF_MASK                      0x00000800
#define _IFS3_SPI2RXIF_LENGTH                    0x00000001

#define _IFS3_SPI3RXIF_POSITION                  0x0000000C
#define _IFS3_SPI3RXIF_MASK                      0x00001000
#define _IFS3_SPI3RXIF_LENGTH                    0x00000001

#define _IFS3_DMA5IF_POSITION                    0x0000000D
#define _IFS3_DMA5IF_MASK                        0x00002000
#define _IFS3_DMA5IF_LENGTH                      0x00000001

#define _IFS3_RTCIF_POSITION                     0x0000000E
#define _IFS3_RTCIF_MASK                         0x00004000
#define _IFS3_RTCIF_LENGTH                       0x00000001

#define _IFS3_CCP1IF_POSITION                    0x0000000F
#define _IFS3_CCP1IF_MASK                        0x00008000
#define _IFS3_CCP1IF_LENGTH                      0x00000001

#define _IFS4_CCP2IF_POSITION                    0x00000000
#define _IFS4_CCP2IF_MASK                        0x00000001
#define _IFS4_CCP2IF_LENGTH                      0x00000001

#define _IFS4_U1ERIF_POSITION                    0x00000001
#define _IFS4_U1ERIF_MASK                        0x00000002
#define _IFS4_U1ERIF_LENGTH                      0x00000001

#define _IFS4_U2ERIF_POSITION                    0x00000002
#define _IFS4_U2ERIF_MASK                        0x00000004
#define _IFS4_U2ERIF_LENGTH                      0x00000001

#define _IFS4_CRCIF_POSITION                     0x00000003
#define _IFS4_CRCIF_MASK                         0x00000008
#define _IFS4_CRCIF_LENGTH                       0x00000001

#define _IFS4_LVDIF_POSITION                     0x00000008
#define _IFS4_LVDIF_MASK                         0x00000100
#define _IFS4_LVDIF_LENGTH                       0x00000001

#define _IFS4_CTMUIF_POSITION                    0x0000000D
#define _IFS4_CTMUIF_MASK                        0x00002000
#define _IFS4_CTMUIF_LENGTH                      0x00000001

#define _IFS5_I2C1BCIF_POSITION                  0x00000004
#define _IFS5_I2C1BCIF_MASK                      0x00000010
#define _IFS5_I2C1BCIF_LENGTH                    0x00000001

#define _IFS5_I2C2BCIF_POSITION                  0x00000005
#define _IFS5_I2C2BCIF_MASK                      0x00000020
#define _IFS5_I2C2BCIF_LENGTH                    0x00000001

#define _IFS5_SPI3IF_POSITION                    0x0000000A
#define _IFS5_SPI3IF_MASK                        0x00000400
#define _IFS5_SPI3IF_LENGTH                      0x00000001

#define _IFS5_SPI3TXIF_POSITION                  0x0000000B
#define _IFS5_SPI3TXIF_MASK                      0x00000800
#define _IFS5_SPI3TXIF_LENGTH                    0x00000001

#define _IFS5_CCP3IF_POSITION                    0x0000000E
#define _IFS5_CCP3IF_MASK                        0x00004000
#define _IFS5_CCP3IF_LENGTH                      0x00000001

#define _IFS5_CCP4IF_POSITION                    0x0000000F
#define _IFS5_CCP4IF_MASK                        0x00008000
#define _IFS5_CCP4IF_LENGTH                      0x00000001

#define _IFS6_CLC1IF_POSITION                    0x00000000
#define _IFS6_CLC1IF_MASK                        0x00000001
#define _IFS6_CLC1IF_LENGTH                      0x00000001

#define _IFS6_CLC2IF_POSITION                    0x00000001
#define _IFS6_CLC2IF_MASK                        0x00000002
#define _IFS6_CLC2IF_LENGTH                      0x00000001

#define _IFS6_CCT1IF_POSITION                    0x00000005
#define _IFS6_CCT1IF_MASK                        0x00000020
#define _IFS6_CCT1IF_LENGTH                      0x00000001

#define _IFS6_CCT2IF_POSITION                    0x00000006
#define _IFS6_CCT2IF_MASK                        0x00000040
#define _IFS6_CCT2IF_LENGTH                      0x00000001

#define _IFS6_FSTIF_POSITION                     0x0000000A
#define _IFS6_FSTIF_MASK                         0x00000400
#define _IFS6_FSTIF_LENGTH                       0x00000001

#define _IFS6_ECCIF_POSITION                     0x0000000C
#define _IFS6_ECCIF_MASK                         0x00001000
#define _IFS6_ECCIF_LENGTH                       0x00000001

#define _IFS6_RTCCTSIF_POSITION                  0x0000000E
#define _IFS6_RTCCTSIF_MASK                      0x00004000
#define _IFS6_RTCCTSIF_LENGTH                    0x00000001

#define _IFS7_JTAGIF_POSITION                    0x00000005
#define _IFS7_JTAGIF_MASK                        0x00000020
#define _IFS7_JTAGIF_LENGTH                      0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_DMA0IE_POSITION                    0x00000004
#define _IEC0_DMA0IE_MASK                        0x00000010
#define _IEC0_DMA0IE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x00000005
#define _IEC0_IC2IE_MASK                         0x00000020
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000006
#define _IEC0_OC2IE_MASK                         0x00000040
#define _IEC0_OC2IE_LENGTH                       0x00000001

