MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
#define _OSCDIV_DIV0_POSITION                    0x00000000
#define _OSCDIV_DIV0_MASK                        0x00000001
#define _OSCDIV_DIV0_LENGTH                      0x00000001

#define _OSCDIV_DIV1_POSITION                    0x00000001
#define _OSCDIV_DIV1_MASK                        0x00000002
#define _OSCDIV_DIV1_LENGTH                      0x00000001

#define _OSCDIV_DIV2_POSITION                    0x00000002
#define _OSCDIV_DIV2_MASK                        0x00000004
#define _OSCDIV_DIV2_LENGTH                      0x00000001

#define _OSCDIV_DIV3_POSITION                    0x00000003
#define _OSCDIV_DIV3_MASK                        0x00000008
#define _OSCDIV_DIV3_LENGTH                      0x00000001

#define _OSCDIV_DIV4_POSITION                    0x00000004
#define _OSCDIV_DIV4_MASK                        0x00000010
#define _OSCDIV_DIV4_LENGTH                      0x00000001

#define _OSCDIV_DIV5_POSITION                    0x00000005
#define _OSCDIV_DIV5_MASK                        0x00000020
#define _OSCDIV_DIV5_LENGTH                      0x00000001

#define _OSCDIV_DIV6_POSITION                    0x00000006
#define _OSCDIV_DIV6_MASK                        0x00000040
#define _OSCDIV_DIV6_LENGTH                      0x00000001

#define _OSCDIV_DIV7_POSITION                    0x00000007
#define _OSCDIV_DIV7_MASK                        0x00000080
#define _OSCDIV_DIV7_LENGTH                      0x00000001

#define _OSCDIV_DIV8_POSITION                    0x00000008
#define _OSCDIV_DIV8_MASK                        0x00000100
#define _OSCDIV_DIV8_LENGTH                      0x00000001

#define _OSCDIV_DIV9_POSITION                    0x00000009
#define _OSCDIV_DIV9_MASK                        0x00000200
#define _OSCDIV_DIV9_LENGTH                      0x00000001

#define _OSCDIV_DIV10_POSITION                   0x0000000A
#define _OSCDIV_DIV10_MASK                       0x00000400
#define _OSCDIV_DIV10_LENGTH                     0x00000001

#define _OSCDIV_DIV11_POSITION                   0x0000000B
#define _OSCDIV_DIV11_MASK                       0x00000800
#define _OSCDIV_DIV11_LENGTH                     0x00000001

#define _OSCDIV_DIV12_POSITION                   0x0000000C
#define _OSCDIV_DIV12_MASK                       0x00001000
#define _OSCDIV_DIV12_LENGTH                     0x00000001

#define _OSCDIV_DIV13_POSITION                   0x0000000D
#define _OSCDIV_DIV13_MASK                       0x00002000
#define _OSCDIV_DIV13_LENGTH                     0x00000001

#define _OSCDIV_DIV14_POSITION                   0x0000000E
#define _OSCDIV_DIV14_MASK                       0x00004000
#define _OSCDIV_DIV14_LENGTH                     0x00000001

#define _OSCFDIV_TRIM_POSITION                   0x00000007
#define _OSCFDIV_TRIM_MASK                       0x0000FF80
#define _OSCFDIV_TRIM_LENGTH                     0x00000009

#define _OSCFDIV_TRIM8_POSITION                  0x00000007
#define _OSCFDIV_TRIM8_MASK                      0x00000080
#define _OSCFDIV_TRIM8_LENGTH                    0x00000001

#define _OSCFDIV_TRIM7_POSITION                  0x00000008
#define _OSCFDIV_TRIM7_MASK                      0x00000100
#define _OSCFDIV_TRIM7_LENGTH                    0x00000001

#define _OSCFDIV_TRIM6_POSITION                  0x00000009
#define _OSCFDIV_TRIM6_MASK                      0x00000200
#define _OSCFDIV_TRIM6_LENGTH                    0x00000001

#define _OSCFDIV_TRIM5_POSITION                  0x0000000A
#define _OSCFDIV_TRIM5_MASK                      0x00000400
#define _OSCFDIV_TRIM5_LENGTH                    0x00000001

#define _OSCFDIV_TRIM4_POSITION                  0x0000000B
#define _OSCFDIV_TRIM4_MASK                      0x00000800
#define _OSCFDIV_TRIM4_LENGTH                    0x00000001

#define _OSCFDIV_TRIM3_POSITION                  0x0000000C
#define _OSCFDIV_TRIM3_MASK                      0x00001000
#define _OSCFDIV_TRIM3_LENGTH                    0x00000001

#define _OSCFDIV_TRIM2_POSITION                  0x0000000D
#define _OSCFDIV_TRIM2_MASK                      0x00002000
#define _OSCFDIV_TRIM2_LENGTH                    0x00000001

#define _OSCFDIV_TRIM1_POSITION                  0x0000000E
#define _OSCFDIV_TRIM1_MASK                      0x00004000
#define _OSCFDIV_TRIM1_LENGTH                    0x00000001

#define _OSCFDIV_TRIM0_POSITION                  0x0000000F
#define _OSCFDIV_TRIM0_MASK                      0x00008000
#define _OSCFDIV_TRIM0_LENGTH                    0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_VREGS_POSITION                     0x00000008
#define _RCON_VREGS_MASK                         0x00000100
#define _RCON_VREGS_LENGTH                       0x00000001

#define _RCON_CM_POSITION                        0x00000009
#define _RCON_CM_MASK                            0x00000200
#define _RCON_CM_LENGTH                          0x00000001

#define _RCON_RETEN_POSITION                     0x0000000C
#define _RCON_RETEN_MASK                         0x00001000
#define _RCON_RETEN_LENGTH                       0x00000001

