MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
#define _T1CON_TIECS1_POSITION                   0x00000009
#define _T1CON_TIECS1_MASK                       0x00000200
#define _T1CON_TIECS1_LENGTH                     0x00000001

#define _T2CON_TCS_POSITION                      0x00000001
#define _T2CON_TCS_MASK                          0x00000002
#define _T2CON_TCS_LENGTH                        0x00000001

#define _T2CON_T32_POSITION                      0x00000003
#define _T2CON_T32_MASK                          0x00000008
#define _T2CON_T32_LENGTH                        0x00000001

#define _T2CON_TCKPS_POSITION                    0x00000004
#define _T2CON_TCKPS_MASK                        0x00000030
#define _T2CON_TCKPS_LENGTH                      0x00000002

#define _T2CON_TGATE_POSITION                    0x00000006
#define _T2CON_TGATE_MASK                        0x00000040
#define _T2CON_TGATE_LENGTH                      0x00000001

#define _T2CON_TECS_POSITION                     0x00000008
#define _T2CON_TECS_MASK                         0x00000300
#define _T2CON_TECS_LENGTH                       0x00000002

#define _T2CON_TSIDL_POSITION                    0x0000000D
#define _T2CON_TSIDL_MASK                        0x00002000
#define _T2CON_TSIDL_LENGTH                      0x00000001

#define _T2CON_TON_POSITION                      0x0000000F
#define _T2CON_TON_MASK                          0x00008000
#define _T2CON_TON_LENGTH                        0x00000001

#define _T2CON_TCKPS0_POSITION                   0x00000004
#define _T2CON_TCKPS0_MASK                       0x00000010
#define _T2CON_TCKPS0_LENGTH                     0x00000001

#define _T2CON_TCKPS1_POSITION                   0x00000005
#define _T2CON_TCKPS1_MASK                       0x00000020
#define _T2CON_TCKPS1_LENGTH                     0x00000001

#define _T2CON_TECS0_POSITION                    0x00000008
#define _T2CON_TECS0_MASK                        0x00000100
#define _T2CON_TECS0_LENGTH                      0x00000001

#define _T2CON_TECS1_POSITION                    0x00000009
#define _T2CON_TECS1_MASK                        0x00000200
#define _T2CON_TECS1_LENGTH                      0x00000001

#define _T2CON_TIECS_POSITION                    0x00000008
#define _T2CON_TIECS_MASK                        0x00000300
#define _T2CON_TIECS_LENGTH                      0x00000002

#define _T2CON_TIECS0_POSITION                   0x00000008
#define _T2CON_TIECS0_MASK                       0x00000100
#define _T2CON_TIECS0_LENGTH                     0x00000001

#define _T2CON_TIECS1_POSITION                   0x00000009
#define _T2CON_TIECS1_MASK                       0x00000200
#define _T2CON_TIECS1_LENGTH                     0x00000001

#define _T2CON_T45_POSITION                      0x00000003
#define _T2CON_T45_MASK                          0x00000008
#define _T2CON_T45_LENGTH                        0x00000001

#define _T3CON_TCS_POSITION                      0x00000001
#define _T3CON_TCS_MASK                          0x00000002
#define _T3CON_TCS_LENGTH                        0x00000001

#define _T3CON_TCKPS_POSITION                    0x00000004
#define _T3CON_TCKPS_MASK                        0x00000030
#define _T3CON_TCKPS_LENGTH                      0x00000002

#define _T3CON_TGATE_POSITION                    0x00000006
#define _T3CON_TGATE_MASK                        0x00000040
#define _T3CON_TGATE_LENGTH                      0x00000001

#define _T3CON_TECS_POSITION                     0x00000008
#define _T3CON_TECS_MASK                         0x00000300
#define _T3CON_TECS_LENGTH                       0x00000002

#define _T3CON_TSIDL_POSITION                    0x0000000D
#define _T3CON_TSIDL_MASK                        0x00002000
#define _T3CON_TSIDL_LENGTH                      0x00000001

#define _T3CON_TON_POSITION                      0x0000000F
#define _T3CON_TON_MASK                          0x00008000
#define _T3CON_TON_LENGTH                        0x00000001

#define _T3CON_TCKPS0_POSITION                   0x00000004
#define _T3CON_TCKPS0_MASK                       0x00000010
#define _T3CON_TCKPS0_LENGTH                     0x00000001

#define _T3CON_TCKPS1_POSITION                   0x00000005
#define _T3CON_TCKPS1_MASK                       0x00000020
#define _T3CON_TCKPS1_LENGTH                     0x00000001

#define _T3CON_TECS0_POSITION                    0x00000008
#define _T3CON_TECS0_MASK                        0x00000100
#define _T3CON_TECS0_LENGTH                      0x00000001

#define _T3CON_TECS1_POSITION                    0x00000009
#define _T3CON_TECS1_MASK                        0x00000200
#define _T3CON_TECS1_LENGTH                      0x00000001

#define _T3CON_TIECS_POSITION                    0x00000008
#define _T3CON_TIECS_MASK                        0x00000300
#define _T3CON_TIECS_LENGTH                      0x00000002

#define _T3CON_TIECS0_POSITION                   0x00000008
#define _T3CON_TIECS0_MASK                       0x00000100
#define _T3CON_TIECS0_LENGTH                     0x00000001

#define _T3CON_TIECS1_POSITION                   0x00000009
#define _T3CON_TIECS1_MASK                       0x00000200
#define _T3CON_TIECS1_LENGTH                     0x00000001

#define _CTMUCON1L_IRNG_POSITION                 0x00000000
#define _CTMUCON1L_IRNG_MASK                     0x00000003
#define _CTMUCON1L_IRNG_LENGTH                   0x00000002

#define _CTMUCON1L_ITRIM_POSITION                0x00000002
#define _CTMUCON1L_ITRIM_MASK                    0x000000FC
#define _CTMUCON1L_ITRIM_LENGTH                  0x00000006

#define _CTMUCON1L_CTTRIG_POSITION               0x00000008
#define _CTMUCON1L_CTTRIG_MASK                   0x00000100
#define _CTMUCON1L_CTTRIG_LENGTH                 0x00000001

#define _CTMUCON1L_IDISSEN_POSITION              0x00000009
#define _CTMUCON1L_IDISSEN_MASK                  0x00000200
#define _CTMUCON1L_IDISSEN_LENGTH                0x00000001

#define _CTMUCON1L_EDGSEQEN_POSITION             0x0000000A
#define _CTMUCON1L_EDGSEQEN_MASK                 0x00000400
#define _CTMUCON1L_EDGSEQEN_LENGTH               0x00000001

