MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
#define _IOCFA_IOCFA3_POSITION                   0x00000003
#define _IOCFA_IOCFA3_MASK                       0x00000008
#define _IOCFA_IOCFA3_LENGTH                     0x00000001

#define _IOCFA_IOCFA4_POSITION                   0x00000004
#define _IOCFA_IOCFA4_MASK                       0x00000010
#define _IOCFA_IOCFA4_LENGTH                     0x00000001

#define _CNPUA_IOCPA0_POSITION                   0x00000000
#define _CNPUA_IOCPA0_MASK                       0x00000001
#define _CNPUA_IOCPA0_LENGTH                     0x00000001

#define _CNPUA_IOCPA1_POSITION                   0x00000001
#define _CNPUA_IOCPA1_MASK                       0x00000002
#define _CNPUA_IOCPA1_LENGTH                     0x00000001

#define _CNPUA_IOCPA2_POSITION                   0x00000002
#define _CNPUA_IOCPA2_MASK                       0x00000004
#define _CNPUA_IOCPA2_LENGTH                     0x00000001

#define _CNPUA_IOCPA3_POSITION                   0x00000003
#define _CNPUA_IOCPA3_MASK                       0x00000008
#define _CNPUA_IOCPA3_LENGTH                     0x00000001

#define _CNPUA_IOCPA4_POSITION                   0x00000004
#define _CNPUA_IOCPA4_MASK                       0x00000010
#define _CNPUA_IOCPA4_LENGTH                     0x00000001

#define _CNPUA_IOCPUA0_POSITION                  0x00000000
#define _CNPUA_IOCPUA0_MASK                      0x00000001
#define _CNPUA_IOCPUA0_LENGTH                    0x00000001

#define _CNPUA_IOCPUA1_POSITION                  0x00000001
#define _CNPUA_IOCPUA1_MASK                      0x00000002
#define _CNPUA_IOCPUA1_LENGTH                    0x00000001

#define _CNPUA_IOCPUA2_POSITION                  0x00000002
#define _CNPUA_IOCPUA2_MASK                      0x00000004
#define _CNPUA_IOCPUA2_LENGTH                    0x00000001

#define _CNPUA_IOCPUA3_POSITION                  0x00000003
#define _CNPUA_IOCPUA3_MASK                      0x00000008
#define _CNPUA_IOCPUA3_LENGTH                    0x00000001

#define _CNPUA_IOCPUA4_POSITION                  0x00000004
#define _CNPUA_IOCPUA4_MASK                      0x00000010
#define _CNPUA_IOCPUA4_LENGTH                    0x00000001

#define _CNPUA_CNPUA0_POSITION                   0x00000000
#define _CNPUA_CNPUA0_MASK                       0x00000001
#define _CNPUA_CNPUA0_LENGTH                     0x00000001

#define _CNPUA_CNPUA1_POSITION                   0x00000001
#define _CNPUA_CNPUA1_MASK                       0x00000002
#define _CNPUA_CNPUA1_LENGTH                     0x00000001

#define _CNPUA_CNPUA2_POSITION                   0x00000002
#define _CNPUA_CNPUA2_MASK                       0x00000004
#define _CNPUA_CNPUA2_LENGTH                     0x00000001

#define _CNPUA_CNPUA3_POSITION                   0x00000003
#define _CNPUA_CNPUA3_MASK                       0x00000008
#define _CNPUA_CNPUA3_LENGTH                     0x00000001

#define _CNPUA_CNPUA4_POSITION                   0x00000004
#define _CNPUA_CNPUA4_MASK                       0x00000010
#define _CNPUA_CNPUA4_LENGTH                     0x00000001

#define _IOCPUA_IOCPA0_POSITION                  0x00000000
#define _IOCPUA_IOCPA0_MASK                      0x00000001
#define _IOCPUA_IOCPA0_LENGTH                    0x00000001

#define _IOCPUA_IOCPA1_POSITION                  0x00000001
#define _IOCPUA_IOCPA1_MASK                      0x00000002
#define _IOCPUA_IOCPA1_LENGTH                    0x00000001

#define _IOCPUA_IOCPA2_POSITION                  0x00000002
#define _IOCPUA_IOCPA2_MASK                      0x00000004
#define _IOCPUA_IOCPA2_LENGTH                    0x00000001

#define _IOCPUA_IOCPA3_POSITION                  0x00000003
#define _IOCPUA_IOCPA3_MASK                      0x00000008
#define _IOCPUA_IOCPA3_LENGTH                    0x00000001

#define _IOCPUA_IOCPA4_POSITION                  0x00000004
#define _IOCPUA_IOCPA4_MASK                      0x00000010
#define _IOCPUA_IOCPA4_LENGTH                    0x00000001

#define _IOCPUA_IOCPUA0_POSITION                 0x00000000
#define _IOCPUA_IOCPUA0_MASK                     0x00000001
#define _IOCPUA_IOCPUA0_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA1_POSITION                 0x00000001
#define _IOCPUA_IOCPUA1_MASK                     0x00000002
#define _IOCPUA_IOCPUA1_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA2_POSITION                 0x00000002
#define _IOCPUA_IOCPUA2_MASK                     0x00000004
#define _IOCPUA_IOCPUA2_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA3_POSITION                 0x00000003
#define _IOCPUA_IOCPUA3_MASK                     0x00000008
#define _IOCPUA_IOCPUA3_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA4_POSITION                 0x00000004
#define _IOCPUA_IOCPUA4_MASK                     0x00000010
#define _IOCPUA_IOCPUA4_LENGTH                   0x00000001

#define _IOCPUA_CNPUA0_POSITION                  0x00000000
#define _IOCPUA_CNPUA0_MASK                      0x00000001
#define _IOCPUA_CNPUA0_LENGTH                    0x00000001

#define _IOCPUA_CNPUA1_POSITION                  0x00000001
#define _IOCPUA_CNPUA1_MASK                      0x00000002
#define _IOCPUA_CNPUA1_LENGTH                    0x00000001

#define _IOCPUA_CNPUA2_POSITION                  0x00000002
#define _IOCPUA_CNPUA2_MASK                      0x00000004
#define _IOCPUA_CNPUA2_LENGTH                    0x00000001

#define _IOCPUA_CNPUA3_POSITION                  0x00000003
#define _IOCPUA_CNPUA3_MASK                      0x00000008
#define _IOCPUA_CNPUA3_LENGTH                    0x00000001

#define _IOCPUA_CNPUA4_POSITION                  0x00000004
#define _IOCPUA_CNPUA4_MASK                      0x00000010
#define _IOCPUA_CNPUA4_LENGTH                    0x00000001

#define _CNPDA_IOCPDA0_POSITION                  0x00000000
#define _CNPDA_IOCPDA0_MASK                      0x00000001
#define _CNPDA_IOCPDA0_LENGTH                    0x00000001

#define _CNPDA_IOCPDA1_POSITION                  0x00000001
#define _CNPDA_IOCPDA1_MASK                      0x00000002
#define _CNPDA_IOCPDA1_LENGTH                    0x00000001

#define _CNPDA_IOCPDA2_POSITION                  0x00000002
#define _CNPDA_IOCPDA2_MASK                      0x00000004
#define _CNPDA_IOCPDA2_LENGTH                    0x00000001

#define _CNPDA_IOCPDA3_POSITION                  0x00000003
#define _CNPDA_IOCPDA3_MASK                      0x00000008
#define _CNPDA_IOCPDA3_LENGTH                    0x00000001

#define _CNPDA_IOCPDA4_POSITION                  0x00000004
#define _CNPDA_IOCPDA4_MASK                      0x00000010
#define _CNPDA_IOCPDA4_LENGTH                    0x00000001

#define _CNPDA_CNPDA0_POSITION                   0x00000000
#define _CNPDA_CNPDA0_MASK                       0x00000001
#define _CNPDA_CNPDA0_LENGTH                     0x00000001

