MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA702/mcu.h
#define _CNPUB_IOCPUB8_POSITION                  0x00000008
#define _CNPUB_IOCPUB8_MASK                      0x00000100
#define _CNPUB_IOCPUB8_LENGTH                    0x00000001

#define _CNPUB_IOCPUB9_POSITION                  0x00000009
#define _CNPUB_IOCPUB9_MASK                      0x00000200
#define _CNPUB_IOCPUB9_LENGTH                    0x00000001

#define _CNPUB_IOCPUB10_POSITION                 0x0000000A
#define _CNPUB_IOCPUB10_MASK                     0x00000400
#define _CNPUB_IOCPUB10_LENGTH                   0x00000001

#define _CNPUB_IOCPUB11_POSITION                 0x0000000B
#define _CNPUB_IOCPUB11_MASK                     0x00000800
#define _CNPUB_IOCPUB11_LENGTH                   0x00000001

#define _CNPUB_IOCPUB12_POSITION                 0x0000000C
#define _CNPUB_IOCPUB12_MASK                     0x00001000
#define _CNPUB_IOCPUB12_LENGTH                   0x00000001

#define _CNPUB_IOCPUB13_POSITION                 0x0000000D
#define _CNPUB_IOCPUB13_MASK                     0x00002000
#define _CNPUB_IOCPUB13_LENGTH                   0x00000001

#define _CNPUB_IOCPUB14_POSITION                 0x0000000E
#define _CNPUB_IOCPUB14_MASK                     0x00004000
#define _CNPUB_IOCPUB14_LENGTH                   0x00000001

#define _CNPUB_IOCPUB15_POSITION                 0x0000000F
#define _CNPUB_IOCPUB15_MASK                     0x00008000
#define _CNPUB_IOCPUB15_LENGTH                   0x00000001

#define _CNPUB_CNPUB0_POSITION                   0x00000000
#define _CNPUB_CNPUB0_MASK                       0x00000001
#define _CNPUB_CNPUB0_LENGTH                     0x00000001

#define _CNPUB_CNPUB1_POSITION                   0x00000001
#define _CNPUB_CNPUB1_MASK                       0x00000002
#define _CNPUB_CNPUB1_LENGTH                     0x00000001

#define _CNPUB_CNPUB2_POSITION                   0x00000002
#define _CNPUB_CNPUB2_MASK                       0x00000004
#define _CNPUB_CNPUB2_LENGTH                     0x00000001

#define _CNPUB_CNPUB3_POSITION                   0x00000003
#define _CNPUB_CNPUB3_MASK                       0x00000008
#define _CNPUB_CNPUB3_LENGTH                     0x00000001

#define _CNPUB_CNPUB4_POSITION                   0x00000004
#define _CNPUB_CNPUB4_MASK                       0x00000010
#define _CNPUB_CNPUB4_LENGTH                     0x00000001

#define _CNPUB_CNPUB5_POSITION                   0x00000005
#define _CNPUB_CNPUB5_MASK                       0x00000020
#define _CNPUB_CNPUB5_LENGTH                     0x00000001

#define _CNPUB_CNPUB6_POSITION                   0x00000006
#define _CNPUB_CNPUB6_MASK                       0x00000040
#define _CNPUB_CNPUB6_LENGTH                     0x00000001

#define _CNPUB_CNPUB7_POSITION                   0x00000007
#define _CNPUB_CNPUB7_MASK                       0x00000080
#define _CNPUB_CNPUB7_LENGTH                     0x00000001

#define _CNPUB_CNPUB8_POSITION                   0x00000008
#define _CNPUB_CNPUB8_MASK                       0x00000100
#define _CNPUB_CNPUB8_LENGTH                     0x00000001

#define _CNPUB_CNPUB9_POSITION                   0x00000009
#define _CNPUB_CNPUB9_MASK                       0x00000200
#define _CNPUB_CNPUB9_LENGTH                     0x00000001

#define _CNPUB_CNPUB10_POSITION                  0x0000000A
#define _CNPUB_CNPUB10_MASK                      0x00000400
#define _CNPUB_CNPUB10_LENGTH                    0x00000001

#define _CNPUB_CNPUB11_POSITION                  0x0000000B
#define _CNPUB_CNPUB11_MASK                      0x00000800
#define _CNPUB_CNPUB11_LENGTH                    0x00000001

#define _CNPUB_CNPUB12_POSITION                  0x0000000C
#define _CNPUB_CNPUB12_MASK                      0x00001000
#define _CNPUB_CNPUB12_LENGTH                    0x00000001

#define _CNPUB_CNPUB13_POSITION                  0x0000000D
#define _CNPUB_CNPUB13_MASK                      0x00002000
#define _CNPUB_CNPUB13_LENGTH                    0x00000001

#define _CNPUB_CNPUB14_POSITION                  0x0000000E
#define _CNPUB_CNPUB14_MASK                      0x00004000
#define _CNPUB_CNPUB14_LENGTH                    0x00000001

#define _CNPUB_CNPUB15_POSITION                  0x0000000F
#define _CNPUB_CNPUB15_MASK                      0x00008000
#define _CNPUB_CNPUB15_LENGTH                    0x00000001

#define _IOCPUB_IOCPB0_POSITION                  0x00000000
#define _IOCPUB_IOCPB0_MASK                      0x00000001
#define _IOCPUB_IOCPB0_LENGTH                    0x00000001

#define _IOCPUB_IOCPB1_POSITION                  0x00000001
#define _IOCPUB_IOCPB1_MASK                      0x00000002
#define _IOCPUB_IOCPB1_LENGTH                    0x00000001

#define _IOCPUB_IOCPB2_POSITION                  0x00000002
#define _IOCPUB_IOCPB2_MASK                      0x00000004
#define _IOCPUB_IOCPB2_LENGTH                    0x00000001

#define _IOCPUB_IOCPB3_POSITION                  0x00000003
#define _IOCPUB_IOCPB3_MASK                      0x00000008
#define _IOCPUB_IOCPB3_LENGTH                    0x00000001

#define _IOCPUB_IOCPB4_POSITION                  0x00000004
#define _IOCPUB_IOCPB4_MASK                      0x00000010
#define _IOCPUB_IOCPB4_LENGTH                    0x00000001

#define _IOCPUB_IOCPB5_POSITION                  0x00000005
#define _IOCPUB_IOCPB5_MASK                      0x00000020
#define _IOCPUB_IOCPB5_LENGTH                    0x00000001

#define _IOCPUB_IOCPB6_POSITION                  0x00000006
#define _IOCPUB_IOCPB6_MASK                      0x00000040
#define _IOCPUB_IOCPB6_LENGTH                    0x00000001

#define _IOCPUB_IOCPB7_POSITION                  0x00000007
#define _IOCPUB_IOCPB7_MASK                      0x00000080
#define _IOCPUB_IOCPB7_LENGTH                    0x00000001

#define _IOCPUB_IOCPB8_POSITION                  0x00000008
#define _IOCPUB_IOCPB8_MASK                      0x00000100
#define _IOCPUB_IOCPB8_LENGTH                    0x00000001

#define _IOCPUB_IOCPB9_POSITION                  0x00000009
#define _IOCPUB_IOCPB9_MASK                      0x00000200
#define _IOCPUB_IOCPB9_LENGTH                    0x00000001

#define _IOCPUB_IOCPB10_POSITION                 0x0000000A
#define _IOCPUB_IOCPB10_MASK                     0x00000400
#define _IOCPUB_IOCPB10_LENGTH                   0x00000001

